cases/subsonic/Zhang/We500/b_0_PCM/setup/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// omega = k^0.5 / (Cmu^0.25 * L_t)
// con L_t = 0.07 * L_ref (turbulence length scale)
// valore compatibile con inlet turbolento

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 7800;

boundaryField
{
    gasInlet
    {
        type            fixedValue;
        value           uniform 7800;
    }

    outletRight
    {
        type            inletOutlet;
        inletValue      uniform 7800;
        value           uniform 7800;
    }

    outletTop
    {
        type            inletOutlet;
        inletValue      uniform 7800;
        value           uniform 7800;
    }

    bottomWall
    {
        type            omegaWallFunction;
        value           uniform 7800;
    }

    filmTopWall
    {
        type            omegaWallFunction;
        value           uniform 7800;
    }

    stepWall
    {
        type            omegaWallFunction;
        value           uniform 7800;
    }

    front
    {
        type            symmetryPlane;
    }

    back
    {
        type            symmetryPlane;
    }
}

// ************************************************************************* //
