cases/subsonic/Zhang/We500/b_0_PCM/setup/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "rho.*"
    {
        solver diagonal;
    }

    Phi
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-6;
        relTol          0.0;
    }

    p
    {
        solver          GAMG;
        tolerance       1e-6;
        relTol          0.1;
        smoother        DIC;
    }

    pFinal
    {
        $p;
        relTol 0;
    }

    "(U|h|k|omega)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.1;
    }

    "(U|h|k|omega)Final"
    {
        $U;
        relTol 0;
    }

    Yi
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.1;
    }

    YiFinal
    {
        $Yi;
        relTol 0;
    }

    // --- DBM smoothing solvers (Gaussian kernel) ---
    convergenceSU
    {
        solver          PBiCGStab;      // ← cambiato da GAMG (vector field)
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0;              // ← cambiato da 0.01
    }
    convergenceSp
    {
        solver          GAMG;
        tolerance       1e-6;
        relTol          0;
        smoother        GaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        cacheAgglomeration on;
        agglomerator    faceAreaPair;
        nCellsInCoarsestLevel 10;
        mergeLevels     1;
    }

}

PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors  2;
    nCorrectors       3;
    nNonOrthogonalCorrectors 1;
}

relaxationFactors
{
	equations
	{
	    ".*"    1;
	}
}

// ************************************************************************* //
